import * as yup from "yup";

const UserRegisterSchema = yup.object().shape({
  userName: yup
    .string()
    .min(4, "نام کاربری باید حداقل دارای 4 حرف باشد")
    .required("لطفا نام کاربری خود را وارد کنید"),
  email: yup
    .string()
    .email("لطفا ایمیل خود را درست وارد کنید")
    .required("لطفا ایمیل خود را وارد کنید"),
  birthDate: yup
    .string()
    .min(8, "تاریخ تولد حداقل باید دارای 8 حرف باشد")
    .max(10, "تاریخ تولد حداکثر باید دارای 10 حرف باشد")
    .matches(
      /1[3-4]\d\d\/(1[0-2]|[1-9]|0[1-9])\/(0[1-9]|[1-2][0-9]|3[0-1]|[1-9])($)/,
      "تاریخ تولد اشتباه است"
    )
    .required("لطفا تاریخ تولد خود را وارد کنید"),
  nationalNumber: yup
    .string()
    .min(10, "کد ملی شما باید دارای 10 عدد باشد")
    .max(10, "کد ملی شما باید دارای 10 عدد باشد")
    .matches(/^[0-9]{10}$/, "لطفا کد ملی خود را درست وارد کنید")
    .required("لطفا شماره ملی خود را وارد کنید"),
  password: yup
    .string()
    .min(6, "حداقل رمز عبورتان باید 6 کاراکتر باشد")
    .required("لطفا رمز عبور خود را وارد کنید"),
});

export { UserRegisterSchema };
